// 导出格式类型
export const formats = [
  {
    name: "JSON",
    color: "#4CAF50",
    icon: "📊",
    desc: "结构化数据，适合程序处理",
  },
  {
    name: "TXT",
    color: "#2196F3",
    icon: "📝",
    desc: "纯文本格式，适合文档记录",
  },
  {
    name: "Excel",
    color: "#FF9800",
    icon: "📈",
    desc: "表格格式，适合数据分析",
  },
  {
    name: "HTML",
    color: "#9C27B0",
    icon: "🌐",
    desc: "导出 HTML 文件，适合浏览查看",
  },
];

// 导出时间线类型
export const timelineTypes = {
  collect: {
    cat: 3,
    name: "收藏",
    desc: "收藏动画、书籍等",
  },
  progress: {
    cat: 4,
    name: "进度",
    desc: "观看/阅读进度更新",
  },
  tsukkomi: {
    cat: 5,
    name: "吐槽",
    desc: "更新签名、修改昵称和碎碎念记录",
  },
  blog: {
    cat: 6,
    name: "日志",
    desc: "发表的博客文章（非全文）",
  },
  // 舍弃了维基 2、天窗 9
  others: {
    cat: [1, 7, 8],
    name: "其他",
    desc: "社交、人物收藏等（天窗、维基除外）",
  },
};

// 进度动作类型
export const progressAction = [
  // 0 留空
  [],
  [
    "读过", "想读", "读过", "抛弃了"
  ],
  [
    "完成了", "想看", "看过", "抛弃了"
  ],
  [
    "听过", "想听", "听过", "抛弃了"
  ],
  [
    "玩过", "想玩", "玩过", "抛弃了"
  ],
  // 5
  [],
  [
    "完成了", "想看", "看过", "抛弃了"
  ],
]

// 收藏动作类型
export const collectAction = [
  // 留空 0
  [],
  [
    "想读", "部书籍"
  ],
  [
    "想看", "部番组"
  ],
  [
    "想听", "张专辑"
  ],
  [
    "想玩", "部游戏"
  ],
  [
    "读过", "部书籍"
  ],
  [
    "看过", "部番组"
  ],
  [
    "听过", "张专辑"
  ],
  [
    "玩过", "部游戏"
  ],
  [
    "在读", "部书籍"
  ],
  [
    "在看", "部番组"
  ],
  [
    "在听", "张专辑"
  ],
  [
    "在玩", "部游戏"
  ],
  [
    "搁置了", ""
  ],
  [
    "抛弃了", ""
  ]
]
